* Passwords Configs etc
Requires a validly formatted config.ini in the root directory, please use the following format.
#+BEGIN_EXAMPLE
[Assembla]
build_username=BUILD_USER_USERNAME
build_password=BUILD_USER_PASSWORD
X-Api-Key=API_KEY
X-Api-Secret=API_SECRET

[TrafficLive]
username = TRAFFIC_USERNAME
api_token = TRAFFIC_API_TOKEN
#+END_EXAMPLE
+ BUILD_USER_USERNAME :: The username of an administrator who has access to all portfolio sites
+ BUILD_USER_PASSOWRD :: Above user's password
+ API_KEY :: Key generated through assembla's v1 Oauth system by logging into assembla and going to =Profile > API applications & sessions= and creating a new =Application=
+ API_SECRET :: Will be generated and available through the same process as the API_KEY
+ TRAFFIC_USERNAME :: Your traffic-live username
+ TRAFFIC_API_TOKEN :: Generated through the administration panel in traffic live for your user

* Requirements
#+NAME: pip-freeze
#+BEGIN_SRC sh 
source /usr/local/bin/virtualenvwrapper.sh
workon apiutils && pip freeze
#+END_SRC
#+RESULTS: pip-freeze 
| Pygments==1.6         |
| beautifulsoup4==4.2.1 |
| distribute==0.6.34    |
| elpy==1.0.1           |
| ipython==0.13.2       |
| jedi==0.6.0           |
| pudb==2013.3.4        |
| requests==1.2.3       |
| urwid==1.1.1          |
| wsgiref==0.1.2        |
